//===================================================================================
//项目名称：GRS 公共平台 V2.0
//文件描述：每个动态库都要使用的标准头文件 动态库中包含时 预定义GRS_EXPORT宏
//
//模块名称：DLL支持模块
//
//组织（公司、集团）名称：One Man Group
//作者：Gamebaby Rock Sun
//日期：2009-11-18 10:18:15
//修订日期：2017-11-21
// 
//特别注意：该文件没有 #pragma once 定义，也就是该文件会被反复包含，
//这是一个特意而为的设计,千万不要修正，否则很多DLL无法正常编译
//===================================================================================
//取消GRS_DLL的定义
#ifdef GRS_DLL
#undef GRS_DLL
#endif

//-----------------------------------------------------------------------------------
//注意这个文件中没有使用防止重新宏包含的特性，主要是为了方便在多个不同的模块中，
//利用重定义GRS_EXPORT宏的方式灵活的定义导出 导入的情形
//-----------------------------------------------------------------------------------
#if defined GRS_EXPORT

#define GRS_DLL __declspec( dllexport )

#else

#define GRS_DLL __declspec( dllimport )

#endif

#pragma message("    " __DATE__ " " __TIME__ ":使用GRS_DLL = " GRS_STRING(GRS_DLL)" 编译文件......" )

#if defined GRS_EXPORT
#pragma message("    " __DATE__ " " __TIME__ ":已取消GRS_EXPORT宏的定义" )
#undef GRS_EXPORT
#endif 